(function ($) {
    function JsGrid(node, options) {
        var defaults = {
            schema: undefined,
            source: 'example.json',
            render: {},
            countPerPage: 1000000,
            renderPagination: function (jsGrid, total, countPerPage, start, page, totalPages) { },
            prepareRequest: function (page, data) { return { data: data }; },
            prepareResponse: function (page, data) { return data; },
            filter: function (row) { return true; },
            refineRow: function ($tr, tow) { },
            selectable: false,
            sortRows: this.defaultSortRows
        };
        this.options = $.extend(defaults, options);
        this.$node = node;
        if (!this.options.schema) {
            this.schema = {
                columns:
                    $('th', this.$node).get().map(function (th) {
                        return {
                            field: $(th).attr('data-id') || $(th).attr('data-field'),
                            id: $(th).attr('data-id'),
                            sortable: 'true' == $(th).attr('data-sortable'),
                            width: $(th).attr('data-width')
                        };
                    })
            };
        } else {
            this.schema = {
                columns: (this.options.schema || []).map(function (column) {
                    return {
                        field: column.id,
                        id: column.id,
                        sortable: column.sortable,
                        order: column.order,
                        width: column.width,
                        title: column.title || column.id
                    };
                })
            };
            this.initializeSchemaDom();
        }
        var columnsMap = {};
        for (var i = 0; i < this.schema.columns.length; i++){
            columnsMap[this.schema.columns[i].id] = this.schema.columns[i];
            
        }
        this.schema.columnsMap = columnsMap;
        this.init();
        this.load();
        this.$node.data('js-grid', this);
    }

    var fn = JsGrid.prototype;

    fn.initializeSchemaDom = function () {
        this.$node.empty();
        var thead = $('<thead></thead>');
        var tbody = $('<tbody></tbody>');

        var tr = $('<tr></tr>').append(
            this.schema.columns.map(
                function (column) {
                    var th = $('<th></th>').text(column.title);
                    if (column.sortable) {
                        th.attr('data-sortable', 'true');
                    }
                    if (column.order) {
                        th.attr('data-order', column.order);
                    }
                    th.attr('data-id', column.id);
                    if (column.width) {
                        th.attr('data-width', column.width);
                    }
                    return th;
                }
            )
        );

        thead.append(tr);
        this.$node.append(thead);
        this.$node.append(tbody);
    };

    fn.init = function () {
        var self = this;
        $('th', this.$node).each(function (i, th) {
            th = $(th);
            var columnId = th.attr('data-id');
            if (self.schema.columnsMap[columnId] && self.schema.columnsMap[columnId].sortable) {
                th.addClass('js-grid-sortable-th');
                th.click(function () {
                    self.sortByColumn(th);
                });
            }
        });
        if (this.options.selectable)
            this.$node.addClass('js-grid-hover');
        this.refine();
    };

    fn.refine = function () {
        $('th i.js-grid-order-direction', this.$node).remove();
        $('th[data-order]', this.$node).each(function (i, th) {
            th = $(th);
            var order = th.attr('data-order');
            if (order == 'asc') {
                th.append('<i class="js-grid-order-direction">&darr;</i>')
            } else {
                th.append('<i class="js-grid-order-direction">&uarr;</i>')
            }
        });
    };

    fn.sort = function (field, direction) {
        direction = direction || 'asc';
        $('th', this.$node).removeAttr('data-order');
        var $th = $('th[data-id="' + field + '"]', this.$node);
        $th.attr('data-order', direction);
        this.refine();
        this.load();
    };

    fn.sortByColumn = function (th) {
        th = $(th);
        var order = th.attr('data-order') == 'asc' ? 'desc' : 'asc';
        $('th', this.$node).removeAttr('data-order');
        th.attr('data-order', order);
        this.refine();
        this.load();
    };

    fn.setSource = function (source) {
        this.options.source = source;
        this.load();
    };

    fn.load = function (page) {
        var self = this;
        params = $.extend({ page: 0 }, { page: page });
        var queryData = this.getRequestData(params.page);
        if (!(this.options.source instanceof Array)) { // Remote data.
            var toSend = this.options.prepareRequest(params.page, queryData) || {};
            $.ajax({
                type: toSend.method || 'GET',
                url: toSend.url || this.options.source,
                data: toSend.data || queryData,
                success: function (raw) {
                    raw = self.options.prepareResponse(params.page, raw);
                    raw.list = raw.list || [];
                    self.clearGrid();
                    self.fillGrid(raw.list);
                    self.fillPagination(raw.count || raw.list.length, queryData.start, queryData.count);
                },
                dataType: 'json'
            })
        } else { // Local data.
            var list = this.options.sortRows(this.getSortFields(), this.options.source);
            list = list.slice(queryData.start, queryData.start + queryData.count);
            this.clearGrid();
            this.fillGrid(list);
            this.fillPagination(this.options.source.length, queryData.start, queryData.count);
        }
    };

    fn.defaultSortRows = function (sortFields, rows) {
        if (sortFields.length == 0) return rows;
        var field = sortFields[0].field;
        var direction = sortFields[0].direction;
        rows.sort(function (a, b) {
            var result;
            if (a[field] > b[field]) {
                result = 1;
            } else if (a[field] < b[field]) {
                result = -1;
            } else {
                result = 0;
            }
            if (direction != 'asc') {
                result = -result;
            }
            return result;
        });
        return rows;
    };

    fn.getSortFields = function () {
        var columnsMap = this.schema.columnsMap;
        return $('th[data-order]', this.$node).get().map(function (th) {
            th = $(th);
            var columnId = th.attr('data-id');
            var field = columnsMap[columnId].field;
            return { field: field, direction: th.attr('data-order') };
        });
    };

    fn.getRequestData = function (page) {
        var queryData = {
            start: page * this.options.countPerPage,
            count: this.options.countPerPage
        };
        queryData.sortFields = this.getSortFields();
        return queryData;
    };

    fn.refresh = function () {
        this.clearGrid();
        this.fillGrid(this.previousRows);
    };

    fn.fillPagination = function (count, start, countPerPage) {
        this.options.renderPagination(this,
            count,
            countPerPage,
            start,
            Math.round(start / countPerPage),
            Math.max(1, Math.ceil(count / countPerPage)));
    };

    fn.fillGrid = function (rows) {
        rows = rows || [];
        var self = this;
        this.previousRows = rows;
        rows = rows.filter(this.options.filter);
        var defaultRenderer = function (column, row) {
            return self.escapeHtml(row[column.field]);
        };
        var rowElements = rows.map(function (row) {
            var tr = $('<tr />').append(
                self.schema.columns.map(
                    function (column) {
                        var renderer = self.options.render[column.id] || defaultRenderer;
                        var td = $('<td />').html(renderer(column, row));
                        if (column.width)
                            td.css('width', column.width);
                        return td;
                    }
                )
            );
            self.options.refineRow(tr, row);
            tr.data('row', row);
            return tr;
        });
        $('tbody', this.$node).append(rowElements);
        if (this.options.selectable) {
            $('tbody tr', this.$node).click(function () {
                $('tr', self.$node).removeClass('js-grid-selected');
                $(this).addClass('js-grid-selected');
                var $tr = $(this);
                setTimeout(function () {
                    self.$node.trigger('selection-changed', [[$tr.data('row')], [$tr]]);
                }, 1);
            });
        }
        this.$node.data('rows', rows);
    };

    fn.escapeHtml = function (s) {
        if (!s) return s;
        if (typeof s != 'string') return s;
        var tagsToReplace = {
            '&': '&amp;',
            '<': '&lt;',
            '>': '&gt;'
        };
        return s.replace(/[&<>]/g, function (tag) {
            return tagsToReplace[tag] || tag;
        });
    };

    fn.getSelection = function () {
        return $('tbody tr.js-grid-selected', this.$node).map(function (i, e) {
            return $(e).data('row');
        }).get();
    };

    fn.clearGrid = function () {
        $('tbody tr', this.$node).remove();
        if (this.options.selectable)
            this.$node.trigger('selection-changed', [[], []]);
    };

    fn.getRows = function () {
        return this.previousRows || [];
    };

    // jQuery adapter.
    $.fn.jsGrid = function (options) {
        return this.each(function () {
            if (!$(this).data('js-grid')) {
                $(this).data('js-grid', new JsGrid($(this), options));
            }
        });
    };
})(jQuery);


$(document).ready(function () {
    hljs.initHighlightingOnLoad();
    hljs.tabReplace = '    '; // 4 spaces
    // Example 1.

    $('#grid12').jsGrid({
        
source : [
{"코드":null,"과목명":null,"학점":null,"분반":null,"정원":null,"개설학부":null,"대상":null,"교수님":null,"비고":null,"신청인원":null,"영강":null,"시간":null}
                    ],
        schema: [
            { sortable: true, id: '코드', title: '코드', width:'4%'  },
            { id: '과목명', title: '과목명', width:'15%'  },
            { id: '학점', title: '학점', width:'7%'  },
            { id: '분반', title: '분반', width:'7%'  },
            { id: '정원', title: '정원', width:'7%'  },
            { id: '개설학부', title: '개설학부', width:'13%'  },
            { id: '대상', title: '대상', width:'13%'  },
            { id: '교수님', title: '교수님', width:'9%'  },
            { id: '비고', title: '비고', width:'7%'  },
            { id: '신청인원', title: '신청인원', width:'7%'  },
            {id:'영강', title:'영강', width:'7%' }
        ],

        selectable : true
    });

    $('#grid11').jsGrid({

       /* source:[
        {"코드":"MEE430","과목명":"LED광학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"주병윤","비고":"N","신청인원":"1","영강":"N", "[112,113,114,115,314,315,316,317,]"}
{"코드":"MEE430","과목명":"LED광학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"주병윤","비고":"N","신청인원":"1","영강":"N","[112,113,114,115,314,315,316,317,]"}
{"코드":"MED711","과목명":"계측공학","학점":"3","분반":"01","정원":"20","개설학부":"기계공학부","대상":"기계 4","교수님":"정경석","비고":"N","신청인원":"1","영강":"N","[112,113,114,115,314,315,316,317,]"},
{"코드":"MEG861","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 3","교수님":"조병관","비고":"N","신청인원":"1","영강":"N","[318,319,]"},
{"코드":"MEG871","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"150","개설학부":"기계공학부","대상":"기계 3","교수님":"조병관","비고":"N","신청인원":"1","영강":"N","[318,319,]"},
{"코드":"MEC581","과목명":"그래피칼프로그래밍","학점":"3","분반":"01","정원":"20","개설학부":"기계공학부","대상":"기계 4","교수님":"최성주","비고":"N","신청인원":"1","영강":"N","[100,101,102,103,204,205,206,207,]"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"이광주","비고":"N","신청인원":"0","영강":"N","[314,315,316,317,]"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"02","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"양승용","비고":"N","신청인원":"0","영강":"N","[314,315,316,317,]"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"03","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"주병윤","비고":"N","신청인원":"0","영강":"N","[4,5,208,209,]"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"04","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"이해성","비고":"N","신청인원":"0","영강":"N","[4,5,208,209,]"},
{"코드":"MED600","과목명":"기초유한요소법","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"양승용","비고":"N","신청인원":"1","영강":"N","[204,205,206,207,310,311,312,313,]"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"조병관","비고":"N","신청인원":"0","영강":"N","[14,15,16,17,200,201,]"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"조병관","비고":"N","신청인원":"0","영강":"N","[100,101,102,103,202,203,]"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"정해일","비고":"N","신청인원":"0","영강":"N","[4,5,204,205,206,207,]"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"신동호","비고":"N","신청인원":"0","영강":"N","[204,205,206,207,304,305,]"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"05","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"다니엘트레이너","비고":"Y","신청인원":"0","영강":"N","[4,5,200,201,202,203,]"},
{"코드":"MEH220","과목명":"로봇공학개론","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"이고르","비고":"Y","신청인원":"1","영강":"N","[4,5,6,7,200,201,202,203,]"},
],*/
source : [
{"code":"MEE430","과목명":"LED광학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"주병윤","비고":"N","신청인원":"1","영강":"N","시간":"[8,9,10,11,310,311,312,313,]"},
{"code":"MED711","과목명":"계측공학","학점":"3","분반":"01","정원":"20","개설학부":"기계공학부","대상":"기계 4","교수님":"정경석","비고":"N","신청인원":"1","영강":"N","시간":"[112,113,114,115,314,315,316,317,]"},
{"code":"MEG861","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 3","교수님":"조병관","비고":"N","신청인원":"1","영강":"N","시간":"[318,319,]"},
{"code":"MEG871","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"150","개설학부":"기계공학부","대상":"기계 3","교수님":"조병관","비고":"N","신청인원":"1","영강":"N","시간":"[318,319,]"},
{"code":"MEC581","과목명":"그래피칼프로그래밍","학점":"3","분반":"01","정원":"20","개설학부":"기계공학부","대상":"기계 4","교수님":"최성주","비고":"N","신청인원":"1","영강":"N","시간":"[100,101,102,103,204,205,206,207,]"},
{"code":"MEC365","과목명":"기계재료학","학점":"2","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"이광주","비고":"N","신청인원":"0","영강":"N","시간":"[314,315,316,317,]"},
{"code":"MEC365","과목명":"기계재료학","학점":"2","분반":"02","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"양승용","비고":"N","신청인원":"0","영강":"N","시간":"[314,315,316,317,]"},
{"code":"MEC365","과목명":"기계재료학","학점":"2","분반":"03","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"주병윤","비고":"N","신청인원":"0","영강":"N","시간":"[4,5,208,209,]"},
{"code":"MEC365","과목명":"기계재료학","학점":"2","분반":"04","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"이해성","비고":"N","신청인원":"0","영강":"N","시간":"[4,5,208,209,]"},
{"code":"MED600","과목명":"기초유한요소법","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"양승용","비고":"N","신청인원":"1","영강":"N","시간":"[204,205,206,207,310,311,312,313,]"},
{"code":"MEB321","과목명":"동역학","학점":"3","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"조병관","비고":"N","신청인원":"0","영강":"N","시간":"[14,15,16,17,200,201,]"},
{"code":"MEB321","과목명":"동역학","학점":"3","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"조병관","비고":"N","신청인원":"0","영강":"N","시간":"[100,101,102,103,202,203,]"},
{"code":"MEB321","과목명":"동역학","학점":"3","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"정해일","비고":"N","신청인원":"0","영강":"N","시간":"[4,5,204,205,206,207,]"},
{"code":"MEB321","과목명":"동역학","학점":"3","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"신동호","비고":"N","신청인원":"0","영강":"N","시간":"[204,205,206,207,304,305,]"},
{"code":"MEB321","과목명":"동역학","학점":"3","분반":"05","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"다니엘트레이너","비고":"Y","신청인원":"0","영강":"N","시간":"[4,5,200,201,202,203,]"},
{"code":"MEH220","과목명":"로봇공학개론","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"이고르","비고":"Y","신청인원":"1","영강":"N","시간":"[4,5,6,7,200,201,202,203,]"},
],
/*
        source : [
{"코드":"MEE430","과목명":"LED광학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"주병윤","비고":"N","신청인원":"1","영강":"N","시간": "[112,113,114,115,314,315,316,317,]"},
{"코드":"MED711","과목명":"계측공학","학점":"3","분반":"01","정원":"20","개설학부":"기계공학부","대상":"기계 4","교수님":"정경석","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEG861","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 3","교수님":"조병관","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEG871","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"150","개설학부":"기계공학부","대상":"기계 3","교수님":"조병관","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEC581","과목명":"그래피칼프로그래밍","학점":"3","분반":"01","정원":"20","개설학부":"기계공학부","대상":"기계 4","교수님":"최성주","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"이광주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"02","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"양승용","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"03","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"주병윤","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC365","과목명":"기계재료학","학점":"2","분반":"04","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"이해성","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MED600","과목명":"기초유한요소법","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"양승용","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"조병관","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"조병관","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"정해일","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"신동호","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB321","과목명":"동역학","학점":"3","분반":"05","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"다니엘트레이너","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MEH220","과목명":"로봇공학개론","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"이고르","비고":"Y","신청인원":"1","영강":"N"},
{"코드":"MEF510","과목명":"마이크로시스템설계","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"김승모","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MED722","과목명":"메카트로닉스","학점":"3","분반":"01","정원":"25","개설학부":"기계공학부","대상":"기계 3","교수님":"유승열","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEC322","과목명":"배관공학실습","학점":"2","분반":"01","정원":"35","개설학부":"기계공학부","대상":"기계 2","교수님":"박운진","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC322","과목명":"배관공학실습","학점":"2","분반":"02","정원":"35","개설학부":"기계공학부","대상":"기계 2","교수님":"박운진","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEF820","과목명":"비파괴검사공학","학점":"3","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 4","교수님":"국정한","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEF630","과목명":"생산가공시스템","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"이해성","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEE440","과목명":"생산공학","학점":"3","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 3","교수님":"박성제","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEH300","과목명":"시스템동역학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"이고르","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MEE800","과목명":"에너지변환공학","학점":"3","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 4","교수님":"박일환","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEC402","과목명":"열유체공학실험","학점":"2","분반":"01","정원":"35","개설학부":"기계공학부","대상":"기계 3","교수님":"이정훈","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEE822","과목명":"열유체시스템","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"박승경","비고":"Y","신청인원":"1","영강":"N"},
{"코드":"MEB341","과목명":"유체역학","학점":"3","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"정경석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB341","과목명":"유체역학","학점":"3","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"정경석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB341","과목명":"유체역학","학점":"3","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"이정훈","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB341","과목명":"유체역학","학점":"3","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"박승경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB341","과목명":"유체역학","학점":"3","분반":"05","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"박승경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC201","과목명":"응용CAD실습","학점":"2","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"국정한","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC201","과목명":"응용CAD실습","학점":"2","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"국정한","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC201","과목명":"응용CAD실습","학점":"2","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"유승열","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC201","과목명":"응용CAD실습","학점":"2","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"박성제","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC201","과목명":"응용CAD실습","학점":"2","분반":"05","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"함종석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC340","과목명":"응용CAM실습","학점":"2","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"최성주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC340","과목명":"응용CAM실습","학점":"2","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"최성주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEC412","과목명":"응용역학실험","학점":"2","분반":"01","정원":"35","개설학부":"기계공학부","대상":"기계 3","교수님":"이광주","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MEC412","과목명":"응용역학실험","학점":"2","분반":"02","정원":"35","개설학부":"기계공학부","대상":"기계 3","교수님":"이광주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEH341","과목명":"응용제어공학","학점":"3","분반":"01","정원":"30","개설학부":"기계공학부","대상":"기계 3","교수님":"신동호","비고":"Y","신청인원":"1","영강":"N"},
{"코드":"MEH341","과목명":"응용제어공학","학점":"3","분반":"02","정원":"30","개설학부":"기계공학부","대상":"기계 3","교수님":"유승한","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEB510","과목명":"재료거동학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"양승용","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MED832","과목명":"전산유체역학","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"김승모","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEC260","과목명":"전자회로실습","학점":"2","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 2","교수님":"유승한","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB301","과목명":"정역학","학점":"2","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"정해일","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB301","과목명":"정역학","학점":"2","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"주병윤","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB301","과목명":"정역학","학점":"2","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"다니엘트레이너","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MEB301","과목명":"정역학","학점":"2","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"함종석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEB301","과목명":"정역학","학점":"2","분반":"05","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"함종석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEG881","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 4","교수님":"조병관","비고":"N","신청인원":"2","영강":"N"},
{"코드":"MEG891","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"150","개설학부":"기계공학부","대상":"기계 4","교수님":"조병관","비고":"N","신청인원":"2","영강":"N"},
{"코드":"MEH390","과목명":"지능형시스템설계","학점":"3","분반":"01","정원":"25","개설학부":"기계공학부","대상":"기계 4","교수님":"유승한","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MEE632","과목명":"진동및소음","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 3","교수님":"정해일","비고":"Y","신청인원":"1","영강":"N"},
{"코드":"MEC351","과목명":"친환경공학개론","학점":"3","분반":"01","정원":"50","개설학부":"기계공학부","대상":"기계 4","교수님":"이정훈","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"유승열","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"진영욱","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"함종석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 1","교수님":"함종석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"01","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"진영욱","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"02","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"다니엘트레이너","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"03","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"이해성","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"04","정원":"40","개설학부":"기계공학부","대상":"기계 2","교수님":"이해성","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MEH320","과목명":"하이브리드자동차개론","학점":"3","분반":"01","정원":"45","개설학부":"기계공학부","대상":"기계 4","교수님":"정진은","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB386","과목명":"3D CAD 및 실습","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"민동균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTF212","과목명":"CNC가공및실습","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"김문기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA700","과목명":"계측공학및실험","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 제어","교수님":"원윤재","비고":"N","신청인원":"1","영강":"N"},
{"코드":"BSM461","과목명":"공업통계학및실습","학점":"3","분반":"03","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"원윤재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTC742","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"200","개설학부":"메카트로닉스공학부","대상":"메카 3","교수님":"이인석","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MTC752","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"200","개설학부":"메카트로닉스공학부","대상":"메카 3","교수님":"이인석","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MTB402","과목명":"기계공작법","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"최만성","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA940","과목명":"기계공작실습","학점":"2","분반":"01","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"최만성","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA940","과목명":"기계공작실습","학점":"2","분반":"02","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"유중학","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA940","과목명":"기계공작실습","학점":"2","분반":"03","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"김문기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB471","과목명":"기계공학실험","학점":"2","분반":"01","정원":"35","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"민동균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB471","과목명":"기계공학실험","학점":"2","분반":"02","정원":"35","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"김광선","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB417","과목명":"기계요소설계","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"허용정","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MTB417","과목명":"기계요소설계","학점":"3","분반":"02","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 전체 제어","교수님":"김병기","비고":"Y","신청인원":"0.5","영강":"N"},
{"코드":"MTB417","과목명":"기계요소설계","학점":"3","분반":"03","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 디지","교수님":"장영철","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA400","과목명":"기계제어공학Ⅱ","학점":"3","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 3 제어","교수님":"이인석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB433","과목명":"기계진동학","학점":"3","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 3 제어","교수님":"안채헌","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB433","과목명":"기계진동학","학점":"3","분반":"02","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 3 디지","교수님":"김노유","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB374","과목명":"기구학","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"정동택","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB374","과목명":"기구학","학점":"2","분반":"02","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"류길하","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB483","과목명":"기전시스템기초설계","학점":"2","분반":"01","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"오윤식","비고":"Y","신청인원":"0.5","영강":"N"},
{"코드":"MTB483","과목명":"기전시스템기초설계","학점":"2","분반":"02","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"오윤식","비고":"Y","신청인원":"0.5","영강":"N"},
{"코드":"MTB483","과목명":"기전시스템기초설계","학점":"2","분반":"03","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"오윤식","비고":"Y","신청인원":"0.5","영강":"N"},
{"코드":"MTB325","과목명":"동역학","학점":"3","분반":"01","정원":"23","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"류길하","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB326","과목명":"동역학","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"허용정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB325","과목명":"동역학","학점":"3","분반":"02","정원":"23","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB325","과목명":"동역학","학점":"3","분반":"03","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"김노유","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTF194","과목명":"동적시스템설계및실습","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 디지","교수님":"이상순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTF281","과목명":"디스플레이공학개론","학점":"3","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 4 디지","교수님":"오윤식","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MCA284","과목명":"디지털회로설계및실습","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"김종원","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA284","과목명":"디지털회로설계및실습","학점":"3","분반":"02","정원":"23","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"성상만","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA284","과목명":"디지털회로설계및실습","학점":"3","분반":"03","정원":"23","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"김홍근","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA670","과목명":"로봇공학및실습","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 4 제어","교수님":"류길하","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB426","과목명":"마이크로프로세서및실습1","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"정동택","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA358","과목명":"마이크로프로세서및실습2","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 제어","교수님":"이인석","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA358","과목명":"마이크로프로세서및실습2","학점":"3","분반":"02","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 디지","교수님":"강기호","비고":"N","신청인원":"0.5","영강":"Y"},
{"코드":"CCT346","과목명":"반도체공학및실습","학점":"3","분반":"03","정원":"40","개설학부":"메카트로닉스공학부","대상":"메카 3 제어","교수님":"오윤식","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MTF222","과목명":"사출금형설계","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"유중학","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MTA482","과목명":"생산계획및관리","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 4 생산","교수님":"김문기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTA450","과목명":"생산설계기술","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 4 생산","교수님":"윤영한","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MCA652","과목명":"센서및계측공학","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 디지","교수님":"김홍근","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"05","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"정동택","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"06","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"허준영","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"07","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"김노유","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTD890","과목명":"에너지시스템및실습","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 4 디지","교수님":"장영철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTD834","과목명":"열유체시뮬레이션공학및실습","학점":"3","분반":"01","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 4 디지","교수님":"김광선","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA213","과목명":"유공압기초실습","학점":"2","분반":"01","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"허준영","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA213","과목명":"유공압기초실습","학점":"2","분반":"02","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"허준영","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA213","과목명":"유공압기초실습","학점":"2","분반":"03","정원":"30","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"허준영","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MTA490","과목명":"유한요소법및실습","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"윤영한","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MTF172","과목명":"임베디드시스템및실습","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 4 디지","교수님":"성상만","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MTA501","과목명":"재료강도학","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 4 생산","교수님":"윤영한","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"MTA515","과목명":"재료과학 및 공학","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 4 생산","교수님":"민동균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTD842","과목명":"전산유체역학및실습","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"장영철","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"MCA333","과목명":"전자회로기초및실습","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 2 제어","교수님":"진경복","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA333","과목명":"전자회로기초및실습","학점":"3","분반":"02","정원":"23","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"강기호","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA333","과목명":"전자회로기초및실습","학점":"3","분반":"03","정원":"23","개설학부":"메카트로닉스공학부","대상":"메카 2 디지","교수님":"김홍근","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTE604","과목명":"절삭학및DOE","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"최만성","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB443","과목명":"정역학","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"민동균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB443","과목명":"정역학","학점":"2","분반":"02","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"원윤재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTB443","과목명":"정역학","학점":"2","분반":"03","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"이상순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MTC805","과목명":"제어공학 및 실습","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 디지","교수님":"성상만","비고":"N","신청인원":"0","영강":"N"},
{"코드":"MCA620","과목명":"제어시스템설계및실험","학점":"3","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 3 제어","교수님":"김병기","비고":"Y","신청인원":"1","영강":"N"},
{"코드":"MTA511","과목명":"제품디자인","학점":"2","분반":"01","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 4 생산","교수님":"유중학","비고":"N","신청인원":"1","영강":"N"},
{"코드":"MTC903","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"200","개설학부":"메카트로닉스공학부","대상":"메카 4","교수님":"이인석","비고":"N","신청인원":"2","영강":"N"},
{"코드":"MTC904","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"200","개설학부":"메카트로닉스공학부","대상":"메카 4","교수님":"이인석","비고":"N","신청인원":"2","영강":"N"},
{"코드":"MTA531","과목명":"창의적설계및실습(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 3 생산","교수님":"허용정","비고":"N","신청인원":"0.5","영강":"N"},
{"코드":"CCT892","과목명":"친환경에너지공학및실습","학점":"2","분반":"03","정원":"50","개설학부":"메카트로닉스공학부","대상":"메카 2 생산","교수님":"김광선","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"08","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"윤영한","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"09","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"김병기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM561","과목명":"프로그래밍및실습","학점":"3","분반":"10","정원":"48","개설학부":"메카트로닉스공학부","대상":"메카 1","교수님":"이상순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB304","과목명":"객체지향프로그래밍","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"최강선","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM461","과목명":"공업통계학및실습","학점":"3","분반":"01","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"김한종","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM461","과목명":"공업통계학및실습","학점":"3","분반":"02","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"랜스키","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"IFA461","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"정종대","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFB371","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"임재열","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFC431","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"이재오","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFA471","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"정종대","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFB381","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"임재열","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFC441","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"80","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"이재오","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFB440","과목명":"광전자공학","학점":"3","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"박종운","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA260","과목명":"교류회로이론","학점":"3","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"손영득","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC510","과목명":"기초ICT공학및실습","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 정보","교수님":"김한종","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFE111","과목명":"기초전자실습","학점":"2","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전기","교수님":"노대석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFE111","과목명":"기초전자실습","학점":"2","분반":"02","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"박종운","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFE111","과목명":"기초전자실습","학점":"2","분반":"03","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"김용재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC281","과목명":"네트워크보안","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"박영길","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC421","과목명":"네트워크응용프로그래밍","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"이재오","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFC240","과목명":"데이터통신","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"설순욱","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFA161","과목명":"디지틀시스템설계및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"정종대","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB170","과목명":"디지틀시스템설계및실습","학점":"3","분반":"01","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"미정","비고":"N","신청인원":"1","영강":"Y"},
{"코드":"IFB170","과목명":"디지틀시스템설계및실습","학점":"3","분반":"02","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"미정","비고":"N","신청인원":"1","영강":"Y"},
{"코드":"IFB170","과목명":"디지틀시스템설계및실습","학점":"3","분반":"03","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"미정","비고":"N","신청인원":"1","영강":"Y"},
{"코드":"IFB292","과목명":"디지틀신호처리및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"임재열","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"IFB292","과목명":"디지틀신호처리및실습","학점":"3","분반":"02","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"임재열","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"IFB250","과목명":"디지틀통신","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전자","교수님":"강성진","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC181","과목명":"마이크로프로세서및실습","학점":"3","분반":"01","정원":"24","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"이명의","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC181","과목명":"마이크로프로세서및실습","학점":"3","분반":"02","정원":"24","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"이명의","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB410","과목명":"마이크로프로세서및실습Ⅰ","학점":"3","분반":"01","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"신동욱","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFB410","과목명":"마이크로프로세서및실습Ⅰ","학점":"3","분반":"02","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"신동욱","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFB410","과목명":"마이크로프로세서및실습Ⅰ","학점":"3","분반":"03","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"신동욱","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IFB335","과목명":"멀티미디어 공학","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전자","교수님":"최강선","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC354","과목명":"무선통신","학점":"3","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"오창헌","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CCT346","과목명":"반도체공학및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"서화일","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CCT346","과목명":"반도체공학및실습","학점":"3","분반":"02","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"서화일","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA391","과목명":"소형전동기","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전기","교수님":"박창순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"위상봉","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"02","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"이직렬","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"03","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"모하이센","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"BSM510","과목명":"수치해석및실습","학점":"3","분반":"04","정원":"28","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"박종운","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA600","과목명":"스마트그리드공학및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전기","교수님":"노대석","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFC212","과목명":"운영체제","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"이재오","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFC341","과목명":"이동통신","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 정보","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC374","과목명":"인터네트워킹실습","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"강승찬","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFA193","과목명":"임베디드 응용 및 실습","학점":"3","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"정종대","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"IFB433","과목명":"임베디드소프트웨어및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"강성진","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC412","과목명":"임베디드응용 및 실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 정보","교수님":"이명의","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC152","과목명":"자료구조및알고리즘","학점":"3","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"설순욱","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFA252","과목명":"전기공학실습Ⅱ","학점":"3","분반":"01","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"박창순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA252","과목명":"전기공학실습Ⅱ","학점":"3","분반":"02","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"정종대","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA451","과목명":"전기기기Ⅱ및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"박창순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA451","과목명":"전기기기Ⅱ및실습","학점":"3","분반":"02","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"박창순","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB181","과목명":"전기자기학 II","학점":"3","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"이직렬","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB181","과목명":"전기자기학 II","학점":"3","분반":"02","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"이직렬","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA155","과목명":"전기자기학II","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"위상봉","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA280","과목명":"전기전자재료","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"위상봉","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA272","과목명":"전기회로시뮬레이션","학점":"2","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"오성철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA361","과목명":"전동기구동및실습","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"오성철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA320","과목명":"전력공학","학점":"3","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"오용택","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB232","과목명":"전자공학실습 II","학점":"2","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"서화일","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB232","과목명":"전자공학실습 II","학점":"2","분반":"02","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"강성진","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA151","과목명":"전자회로","학점":"3","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전기","교수님":"정종대","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB150","과목명":"전자회로","학점":"3","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"조현찬","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB150","과목명":"전자회로","학점":"3","분반":"02","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 전자","교수님":"조현찬","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFC163","과목명":"전자회로및실습","학점":"4","분반":"01","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 2 정보","교수님":"박형근","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"IFB282","과목명":"전자회로실습","학점":"2","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"조현찬","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB190","과목명":"제어공학","학점":"3","분반":"01","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"김용재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFB190","과목명":"제어공학","학점":"3","분반":"02","정원":"30","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전자","교수님":"김용재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IFA291","과목명":"제어시스템설계","학점":"3","분반":"01","정원":"40","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 3 전기","교수님":"미정","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"IFA481","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전기","교수님":"정종대","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFB391","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전자","교수님":"임재열","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFC451","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 정보","교수님":"이재오","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFA491","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전기","교수님":"정종대","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFB401","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 전자","교수님":"임재열","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFC461","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"80","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 4 정보","교수님":"이재오","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFB151","과목명":"창의적공학설계","학점":"2","분반":"01","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"지선호","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFE155","과목명":"창의적공학설계","학점":"3","분반":"01","정원":"50","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전기","교수님":"노대석","비고":"N","신청인원":"3","영강":"N"},
{"코드":"IFB151","과목명":"창의적공학설계","학점":"2","분반":"02","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"지선호","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IFE155","과목명":"창의적공학설계","학점":"3","분반":"02","정원":"45","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 정보","교수님":"설순욱","비고":"N","신청인원":"3","영강":"Y"},
{"코드":"CCT892","과목명":"친환경에너지공학및실습","학점":"2","분반":"01","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CCT892","과목명":"친환경에너지공학및실습","학점":"2","분반":"02","정원":"25","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"05","정원":"16","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 정보","교수님":"박형근","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"06","정원":"16","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 정보","교수님":"강승찬","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"07","정원":"16","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 정보","교수님":"랜스키","비고":"Y","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"08","정원":"23","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전기","교수님":"최성식","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"09","정원":"23","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전기","교수님":"이연옥","비고":"N","신청인원":"0","영강":"N"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"10","정원":"16","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"모하이센","비고":"Y","신청인원":"0","영강":"Y"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"11","정원":"16","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"최강선","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"BSM550","과목명":"프로그래밍언어","학점":"3","분반":"12","정원":"16","개설학부":"전기ㆍ전자ㆍ통신공학부","대상":"전기 1 전자","교수님":"임재열","비고":"N","신청인원":"0","영강":"Y"},
{"코드":"CPA221","과목명":"C++프로그래밍","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 2  , 컴퓨 3  , 컴퓨 4","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA131","과목명":"C프로그래밍Ⅰ","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 전체","교수님":"이재협","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA141","과목명":"C프로그래밍Ⅱ","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"정구철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA141","과목명":"C프로그래밍Ⅱ","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"정구철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA141","과목명":"C프로그래밍Ⅱ","학점":"3","분반":"03","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"조태훈","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA141","과목명":"C프로그래밍Ⅱ","학점":"3","분반":"04","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"조태훈","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC441","과목명":"게임프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"김상연","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS421","과목명":"고급웹프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"문일영","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA910","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"200","개설학부":"컴퓨터공학부","대상":" 3","교수님":"이강환","비고":"N","신청인원":"1","영강":"N"},
{"코드":"CPA920","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"200","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"이강환","비고":"N","신청인원":"1","영강":"N"},
{"코드":"CPA971","과목명":"공학설계와특허","학점":"2","분반":"01","정원":"45","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"이강환","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA120","과목명":"기초전기전자및실습","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"이강환","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA120","과목명":"기초전기전자및실습","학점":"3","분반":"02","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"김윤상","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA120","과목명":"기초전기전자및실습","학점":"3","분반":"03","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"강형주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA120","과목명":"기초전기전자및실습","학점":"3","분반":"04","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"김원태","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS311","과목명":"데이터베이스및실습","학점":"3","분반":"01","정원":"28","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"김은경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS321","과목명":"데이터베이스프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"무하마드","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS321","과목명":"데이터베이스프로그래밍","학점":"3","분반":"02","정원":"45","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"무하마드","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC330","과목명":"데이터통신","학점":"3","분반":"01","정원":"50","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"김원태","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA212","과목명":"디지털공학 및 실습","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 2  , 컴퓨 3  , 컴퓨 4","교수님":"이강환","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA231","과목명":"마이크로프로세서및실습","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"장경식","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA231","과목명":"마이크로프로세서및실습","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"장경식","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA231","과목명":"마이크로프로세서및실습","학점":"3","분반":"03","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"김상연","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA231","과목명":"마이크로프로세서및실습","학점":"3","분반":"04","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"강형주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC361","과목명":"모바일프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"문일영","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC361","과목명":"모바일프로그래밍","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"강승우","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS342","과목명":"소프트웨어공학","학점":"3","분반":"01","정원":"45","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"민준기","비고":"N","신청인원":"1","영강":"N"},
{"코드":"CPS342","과목명":"소프트웨어공학","학점":"3","분반":"02","정원":"45","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"민준기","비고":"N","신청인원":"1","영강":"N"},
{"코드":"CPC490","과목명":"스마트 네트워크 및 실습","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"박승철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC510","과목명":"스마트IoT응용및실습","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"김원태","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC380","과목명":"스크립트프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"한연희","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC380","과목명":"스크립트프로그래밍","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"강승우","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPH341","과목명":"시스템프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"장경식","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPH341","과목명":"시스템프로그래밍","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"서희석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS431","과목명":"웹서비스컴퓨팅및실습","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"한연희","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC311","과목명":"윈도우즈프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPH322","과목명":"응용회로설계및실습","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"강형주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS460","과목명":"인공지능","학점":"3","분반":"01","정원":"45","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"윤한경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA250","과목명":"자료구조및실습","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"최영규","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA250","과목명":"자료구조및실습","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"최영규","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA250","과목명":"자료구조및실습","학점":"3","분반":"03","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"주영복","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA250","과목명":"자료구조및실습","학점":"3","분반":"04","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"무하마드","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA241","과목명":"자바프로그래밍","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"이재협","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA241","과목명":"자바프로그래밍","학점":"3","분반":"02","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"이재협","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA241","과목명":"자바프로그래밍","학점":"3","분반":"03","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"주영복","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA241","과목명":"자바프로그래밍","학점":"3","분반":"04","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 2","교수님":"무하마드","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA930","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"이강환","비고":"N","신청인원":"2","영강":"N"},
{"코드":"CPA940","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"200","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"이강환","비고":"N","신청인원":"2","영강":"N"},
{"코드":"CPA150","과목명":"창의적공학설계","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"김은경","비고":"N","신청인원":"3","영강":"N"},
{"코드":"CPA150","과목명":"창의적공학설계","학점":"3","분반":"02","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"김은경","비고":"N","신청인원":"3","영강":"N"},
{"코드":"CPA150","과목명":"창의적공학설계","학점":"3","분반":"03","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"윤한경","비고":"N","신청인원":"3","영강":"N"},
{"코드":"CPA150","과목명":"창의적공학설계","학점":"3","분반":"04","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 1","교수님":"윤한경","비고":"N","신청인원":"3","영강":"N"},
{"코드":"CPA110","과목명":"컴퓨터공학입문","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 전체","교수님":"정구철","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPC351","과목명":"컴퓨터그래픽스및실습","학점":"3","분반":"01","정원":"40","개설학부":"컴퓨터공학부","대상":"컴퓨 3","교수님":"최영규","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPS450","과목명":"컴퓨터보안","학점":"3","분반":"01","정원":"45","개설학부":"컴퓨터공학부","대상":"컴퓨 4","교수님":"서희석","비고":"N","신청인원":"0","영강":"N"},
{"코드":"CPA260","과목명":"컴퓨터시스템기초설계","학점":"3","분반":"01","정원":"35","개설학부":"컴퓨터공학부","대상":"컴퓨 2  , 컴퓨 3  , 컴퓨 4","교수님":"강승우","비고":"N","신청인원":"3","영강":"N"},
{"코드":"IDA871","과목명":"감성디자인","학점":"3","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARE812","과목명":"건설공정관리및실습","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 3 건축 , 건축 4 건축","교수님":"미정","비고":"N","신청인원":"1","영강":"N"},
{"코드":"ARD730","과목명":"건축계획및각론","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"디자 1 건축","교수님":"박광범","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD561","과목명":"건축계획방법론","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 3 건축","교수님":"박광범","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARB244","과목명":"건축구조의 이해 및 실습","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체 건축","교수님":"이승재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARB244","과목명":"건축구조의 이해 및 실습","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체 건축","교수님":"이승재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD512","과목명":"건축설계Ⅳ","학점":"6","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 3 건축 , 디자 전체","교수님":"김혁기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD532","과목명":"건축설계Ⅵ","학점":"6","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 4 건축","교수님":"김기주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD552","과목명":"건축설계Ⅷ","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 5 건축","교수님":"페드라비시","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD721","과목명":"건축설계스튜디오2","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 2 건축","교수님":"박광범","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD711","과목명":"건축설계스튜디오2실습","학점":"3","분반":"01","정원":"15","개설학부":"디자인ㆍ건축공학부","대상":"건축 2 건축 , 디자 2 건축","교수님":"박광범","비고":"N","신청인원":"1","영강":"N"},
{"코드":"ARD711","과목명":"건축설계스튜디오2실습","학점":"3","분반":"02","정원":"15","개설학부":"디자인ㆍ건축공학부","대상":"건축 2  , 디자 2 건축","교수님":"이영종","비고":"N","신청인원":"1","영강":"N"},
{"코드":"ARE492","과목명":"건축설비","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 3 건축 , 건축 4 건축 , 디자 3 건축","교수님":"장병호","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARE462","과목명":"건축재료설계","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 2 건축 , 디자 2 건축","교수님":"김남호","비고":"N","신청인원":"1","영강":"N"},
{"코드":"ARD351","과목명":"건축표현기법","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체 건축","교수님":"김혁기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARE841","과목명":"경량철골및목구조실습","학점":"2","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 2 건축","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARB902","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 전체 건축","교수님":"미정","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IDA771","과목명":"공학설계Ⅰ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"1","영강":"N"},
{"코드":"ARB912","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 전체 건축","교수님":"미정","비고":"N","신청인원":"1","영강":"N"},
{"코드":"IDA781","과목명":"공학설계Ⅱ(캡스톤디자인)","학점":"1","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"1","영강":"N"},
{"코드":"ARE723","과목명":"구조설계및실습","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 4 건축 , 디자 4 건축","교수님":"이승재","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARE407","과목명":"구조역학및응용","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 2 건축 , 디자 2 건축","교수님":"김상섭","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD341","과목명":"근대건축사","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 3 건축 , 건축 4 건축","교수님":"페드라비시","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA231","과목명":"기초실습Ⅱ(캡스톤디자인)","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김형로","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA231","과목명":"기초실습Ⅱ(캡스톤디자인)","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김형로","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD593","과목명":"도시및단지계획","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 3","교수님":"페드라비시","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA262","과목명":"디자인공학론","학점":"3","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"문무경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA850","과목명":"디자인과 마케팅","학점":"2","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA202","과목명":"디자인과인간심리","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA202","과목명":"디자인과인간심리","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA415","과목명":"디자인과특허","학점":"3","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA362","과목명":"디자인사","학점":"3","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김태균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA446","과목명":"디자인커뮤니케이션","학점":"3","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA392","과목명":"디자인표현실습1","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 1  , 디자 1 디자","교수님":"김성준","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA392","과목명":"디자인표현실습1","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 1  , 디자 1 디자","교수님":"김성준","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA921","과목명":"디지털제품디자인","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA921","과목명":"디지털제품디자인","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARB960","과목명":"산업체특강Ⅰ","학점":"2","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 전체","교수님":"김혁기","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA321","과목명":"색채관리및실습","학점":"3","분반":"01","정원":"35","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD322","과목명":"서양건축사","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 2 건축","교수님":"김기주","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA615","과목명":"시스템디자인","학점":"3","분반":"01","정원":"40","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"홍주표","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA403","과목명":"인터랙션디자인","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA403","과목명":"인터랙션디자인","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA551","과목명":"전기전자공학및실습","학점":"2","분반":"01","정원":"30","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"홍주표","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA488","과목명":"제도","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 1  , 디자 1 디자","교수님":"홍주표","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA488","과목명":"제도","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 1  , 디자 1 디자","교수님":"홍주표","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA720","과목명":"제품디자인2","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김태균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA720","과목명":"제품디자인2","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김태균","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA275","과목명":"제품조형실습","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"문무경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA275","과목명":"제품조형실습","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"문무경","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA570","과목명":"조형실습Ⅱ","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김성준","비고":"N","신청인원":"0","영강":"N"},
{"코드":"IDA570","과목명":"조형실습Ⅱ","학점":"3","분반":"02","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"김성준","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARB933","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 전체","교수님":"미정","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IDA581","과목명":"졸업설계Ⅰ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"2","영강":"N"},
{"코드":"ARB934","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 전체","교수님":"미정","비고":"N","신청인원":"2","영강":"N"},
{"코드":"IDA591","과목명":"졸업설계Ⅱ(캡스톤디자인)","학점":"2","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"디자 전체  , 디자 전체 디자","교수님":"정광태","비고":"N","신청인원":"2","영강":"N"},
{"코드":"ARE710","과목명":"철골구조학","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 3 건축 , 건축 4 건축 , 디자 3 건축","교수님":"김상섭","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARE861","과목명":"측량학및실습","학점":"3","분반":"01","정원":"50","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체  , 디자 2 건축","교수님":"미정","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARE851","과목명":"토질및기초실습","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 4 건축","교수님":"김남호","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ARD701","과목명":"환경생태건축","학점":"3","분반":"01","정원":"25","개설학부":"디자인ㆍ건축공학부","대상":"건축 전체 건축","교수님":"김지은","비고":"N","신청인원":"0","영강":"N"},
{"코드":"ENE310","과목명":"결정구조학","학점":"3","분반":"01","정원":"50","개설학부":"에너지신소재화학공학부","대상":"에너 3 신소","교수님":"김석준","비고":"Y","신청인원":"0","영강":"N"},
],









        /*source: [
            { id: '1', name: 'Item 1', count: '10' },
            { id: '2', name: 'Item 2', count: '20' },
            { id: '3', name: 'Item 3', count: '30' }
        ],*/
        schema: [
            { id: 'code', title: '코드', width:'4%'  },
            { id: '과목명', title: '과목명', width:'15%'  },
            { id: '학점', title: '학점', width:'7%'  },
            { id: '분반', title: '분반', width:'7%'  },
            { id: '정원', title: '정원', width:'7%'  },
            { id: '개설학부', title: '개설학부', width:'13%'  },
            { id: '대상', title: '대상', width:'13%'  },
            { id: '교수님', title: '교수님', width:'9%'  },
            { id: '비고', title: '비고', width:'7%'  },
            { id: '신청인원', title: '신청인원', width:'7%'  },
            {id:'영강', title:'영강', width:'7%' }
        ],

        selectable : true
    });

    /*$('#grid11').on('selection-changed', function(event, rows, $rowNodes) {
        console.log(rows[0].code);
    });*/

    $('#grid11').dblclick(function(){ 
        var a = $(this).val('this.code');
        console.log(a);
    });

    /*$(document).ready(function() {    
$(".webcreate").live("click",function(){
var bbsreplll = $(this).attr('id'); 
alert(bbsreplll);
});

}); */


});